
[
    {
        "id":0,
        "date": "May 2023  - Dic 2023",
        "title": "record system for a cosmetic surgery clinic",
        "function": "Software Developer and database desing",
        "company": "University project - UTT",
        "rewiew": "A meticulously planned project, dedicated to enhancing data security and regulatory compliance in patient record storage. Focused on optimizing operational frameworks within aesthetic surgeries clinics, it promises improved efficiency and elevated patient experiences. With a visionary aim to revolutionize clinic management, this endeavor marks a significant stride towards redefining industry standards.",
        "information" : "Embarking on a transformative journey, our project unfolded over three dynamic cuatrimesters, from the 8th to the 10th, with a singular mission: fortify data storage for patient records. At the forefront of our efforts was the enhancement of data security and adherence to regulatory standards, ensuring utmost confidentiality. Our focus honed in on the intricate operational framework of aesthetic surgeries clinics, meticulously crafting solutions to elevate efficiency and augment the patient experience. As the culmination of our endeavors, we envisaged not just an evolution but a revolution in clinic management, poised to redefine standards in aesthetic surgeries.",
        "icon" : "/beautysys.webp",
        "description": "Home Page for Beautysys",
        "type_of_project": "Frontend and Backend",
        "repository": 
        {
            "Program":null,
            "Url": null,
            "Icon":null
        },
        "images":[
            "/beautysys.webp",
            "/beautysys_main.webp"

        ],
        "technologies": [
            "Laravel",
            "laravel jetstream",
            "SQL Server"
        ]

    },{
        "id":1,
        "date": "March 2024  - April 2024",
        "title": "BookNest",
        "function": "Software Developer",
        "company": "Personal Project",
        "rewiew": "This project is a web for a library, and it function is show the books information and the functionability to Saved them i other page. The project is made with the purpose of learning new technologies and improve my skills.",
        "information" : "I made this project for practices, to involve in react project and use recursion for the components, however I made this project with the Zustand Technology for the scalable bearbones state management.",
        "icon" : "/BookNest.webp",
        "description": "Ui desing for BookNest project",
        "type_of_project": "Frontend",
        "repository": 
        {
            "Program":"GitHub",
            "Url": "https://github.com/alejandr029/BookNest.git",
            "Icon": "/Portafolio/Icon/github.svg"
        },
        "images":[
            "/BookNest.webp",
            "/BookNest_saved.webp"
        ],
        "technologies": [
            "React",
            "Zustand",
            "Tailwindcss",
            "TypeScript"
        ]

    }

]
